In [11]:
import pandas as pd

In [12]:
df1=pd.DataFrame({"Name":["vickey","Bill"],"Age":[12,16]})
df2=pd.DataFrame({"Name":["john","sabrina"],"Age":[37,25]})

In [13]:
print(df1)
print('--------------------------------------------------------')
print(df2)

     Name  Age
0  vickey   12
1    Bill   16
--------------------------------------------------------
      Name  Age
0     john   37
1  sabrina   25

# concat check column

# concat Horizontally (axis= column /1)

In [14]:
cars=pd.concat([df1,df2],axis=1)
cars

     Name  Age     Name  Age
0  vickey   12     john   37
1    Bill   16  sabrina   25

# concat Vertically  and ignore index=True (axis=0)

In [15]:
df3=pd.concat([df1,df2],axis=0,ignore_index=True)
df3

      Name  Age
0   vickey   12
1     Bill   16
2     john   37
3  sabrina   25

In [16]:
df4=pd.DataFrame({"Name":["Anshul","Shikha"],"Age":[30,25],"Hobby":["Playing Chess","Reading"]})
df4

     Name  Age          Hobby
0  Anshul   30  Playing Chess
1  Shikha   25        Reading

# outer is the default for the join argument

In [20]:
pd.concat([df3,df4],join='outer',ignore_index=True)

      Name  Age          Hobby
0   vickey   12            NaN
1     Bill   16            NaN
2     john   37            NaN
3  sabrina   25            NaN
4   Anshul   30  Playing Chess
5   Shikha   25        Reading

# Inner stacks only the columns that are shared between the two Dataframe

In [21]:
pd.concat([df3,df4],join='inner',ignore_index=True)

      Name  Age
0   vickey   12
1     Bill   16
2     john   37
3  sabrina   25
4   Anshul   30
5   Shikha   25

# Merge

# Merge check row

In [22]:
size=pd.DataFrame({'Colour':['Red','Blue','Green'],"Size":["M","S","M"]})
gender=pd.DataFrame({'Colour':['Red','Blue','Yellow'],"Sex":["Female","Female","Male"]})

In [24]:
print(size)
print('--------------------------------------------------------------------')
print(gender)

  Colour Size
0    Red    M
1   Blue    S
2  Green    M
--------------------------------------------------------------------
   Colour     Sex
0     Red  Female
1    Blue  Female
2  Yellow    Male

In [25]:
# only show rows where there is a match in the column
# Red and Blue are present in both dataframe
pd.merge(size,gender,how='inner')# how is a keyword

  Colour Size     Sex
0    Red    M  Female
1   Blue    S  Female

In [26]:
#show all the rows and fill row with null values when there is no match
# There is no sex info on green colour and there is no size info on yellow colour
pd.merge(size,gender,how='outer')# how is a keyword

   Colour Size     Sex
0    Blue    S  Female
1   Green    M     NaN
2     Red    M  Female
3  Yellow  NaN    Male

# left

In [28]:
# keep everything that is on the left dataframe which is df1 in this example
# fill in sex info for rows that have matches with df2 and if there in none e.g. green
pd.merge(size,gender,how='left')# how is a keyword

  Colour Size     Sex
0    Red    M  Female
1   Blue    S  Female
2  Green    M     NaN

# right

In [29]:
# keep everything that is on the right dataframe which is df2 in this example
# fill in size info for rows that have matches with df1 and if there in none e.g. yellow
pd.merge(size,gender,how='right')# how is a keyword

   Colour Size     Sex
0     Red    M  Female
1    Blue    S  Female
2  Yellow  NaN    Male